app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" LIMIT $1  [["LIMIT", 1]]
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Blog 1"], ["body", "fgrdhujte"], ["created_at", "2020-12-15 00:03:56.174167"], ["updated_at", "2020-12-15 00:03:56.174167"], ["slug", "blog-1"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "ytruyrtu"], ["body", "yhtyuht"], ["updated_at", "2020-12-15 00:04:08.111688"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.friendly.find(params[:id])