app/controllers/portfolios_controller.rb

  def index
    @portfolio_items = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios"

  def create
    @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def edit
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @portfolio_item = Portfolio.find(params[:id])
    respond_to do |format|
      if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "portfolios" SET "subtitle" = $1, "body" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4

  def show
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def destroy
    # Perform the lookup
    @portfolio_item = Portfolio.find(params[:id])

    # Destroy/delete the record
    @portfolio_item.destroy
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 10]]